```terraform
[command]/home/runner/work/_temp/286e7bad-beec-4b68-8041-eaccfb2cd046/terraform-bin plan -out=environment.tfplan -no-color
module.vpc.data.aws_security_group.ec2_public[0]: Reading...
module.vpc.data.aws_subnet.public_1[0]: Reading...
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.vpc.data.aws_subnet.private_2[0]: Reading...
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.vpc.data.aws_subnet.public_2[0]: Reading...
module.vpc.data.aws_vpc.default: Reading...
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.vpc.data.aws_subnet.private_1[0]: Reading...
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]
module.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...
module.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]
module.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-QDNBQA3GMWJ5L4VRFGEOQFO6EY]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.apigateway.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-l6xivppfkg-DEFAULT_4XX"
      ~ response_parameters = {
          ~ "gatewayresponse.header.Access-Control-Allow-Origin"      = "'http://127.0.0.1:5173'" -> "'https://www.staging.matchyaa.com'"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.apigateway.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-l6xivppfkg-DEFAULT_5XX"
      ~ response_parameters = {
          ~ "gatewayresponse.header.Access-Control-Allow-Origin"      = "'http://127.0.0.1:5173'" -> "'https://www.staging.matchyaa.com'"
            # (3 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.apigateway.aws_api_gateway_gateway_response.unauthorized_response will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "unauthorized_response" {
        id                  = "aggr-l6xivppfkg-UNAUTHORIZED"
      ~ response_parameters = {
          ~ "gatewayresponse.header.Access-Control-Allow-Origin"      = "'http://127.0.0.1:5173'" -> "'https://www.staging.matchyaa.com'"
            # (3 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.sqs.aws_sqs_queue.question_generation_processor_queue will be created
  + resource "aws_sqs_queue" "question_generation_processor_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "staging-question-generation-processor-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn will be created
  + resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/question_generation_processor_queue_arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_url will be created
  + resource "aws_ssm_parameter" "question_generation_processor_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/question_generation_processor_queue_url"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 3 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: environment.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "environment.tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-QDNBQA3GMWJ5L4VRFGEOQFO6EY]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.default_4xx will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {%0A        id                  = "aggr-l6xivppfkg-DEFAULT_4XX"%0A      ~ response_parameters = {%0A          ~ "gatewayresponse.header.Access-Control-Allow-Origin"      = "'http://127.0.0.1:5173'" -> "'https://www.staging.matchyaa.com'"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.default_5xx will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {%0A        id                  = "aggr-l6xivppfkg-DEFAULT_5XX"%0A      ~ response_parameters = {%0A          ~ "gatewayresponse.header.Access-Control-Allow-Origin"      = "'http://127.0.0.1:5173'" -> "'https://www.staging.matchyaa.com'"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.unauthorized_response will be updated in-place%0A  ~ resource "aws_api_gateway_gateway_response" "unauthorized_response" {%0A        id                  = "aggr-l6xivppfkg-UNAUTHORIZED"%0A      ~ response_parameters = {%0A          ~ "gatewayresponse.header.Access-Control-Allow-Origin"      = "'http://127.0.0.1:5173'" -> "'https://www.staging.matchyaa.com'"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.sqs.aws_sqs_queue.question_generation_processor_queue will be created%0A  + resource "aws_sqs_queue" "question_generation_processor_queue" {%0A      + arn                               = (known after apply)%0A      + content_based_deduplication       = false%0A      + deduplication_scope               = (known after apply)%0A      + delay_seconds                     = 90%0A      + fifo_queue                        = false%0A      + fifo_throughput_limit             = (known after apply)%0A      + id                                = (known after apply)%0A      + kms_data_key_reuse_period_seconds = (known after apply)%0A      + max_message_size                  = 2048%0A      + message_retention_seconds         = 86400%0A      + name                              = "staging-question-generation-processor-queue"%0A      + name_prefix                       = (known after apply)%0A      + policy                            = (known after apply)%0A      + receive_wait_time_seconds         = 10%0A      + redrive_allow_policy              = (known after apply)%0A      + redrive_policy                    = (known after apply)%0A      + sqs_managed_sse_enabled           = (known after apply)%0A      + tags_all                          = (known after apply)%0A      + url                               = (known after apply)%0A      + visibility_timeout_seconds        = 300%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn will be created%0A  + resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/question_generation_processor_queue_arn"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_url will be created%0A  + resource "aws_ssm_parameter" "question_generation_processor_queue_url" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/question_generation_processor_queue_url"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0APlan: 3 to add, 3 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: environment.tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "environment.tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```